## İmport

In [75]:
import pandas as pd
import numpy as np

## Series / Seriler

In [76]:
sozluk = { "osman":50, "temel":35, }
sozluk

{'osman': 50, 'temel': 35}

In [77]:
pd.Series(sozluk)

osman    50
temel    35
dtype: int64

In [78]:
yas=[1,2,3,4,5]
isim = ["a","b","c","D","E"]
pd.Series(data=yas,index=isim)

a    1
b    2
c    3
D    4
E    5
dtype: int64

In [79]:
numpDizi = np.array([20,30,40])
pd.Series(data=numpDizi)

0    20
1    30
2    40
dtype: int64

In [80]:
pd.Series(["o","s","m","a","n"],[1,2,3,4,5])

1    o
2    s
3    m
4    a
5    n
dtype: object

In [81]:
sonuc =pd.Series([10,20,30],["osman","temel","ali"])
sonuc2 =pd.Series([100,24,32,70],["osman","temel","ali","mehmet"])
son = sonuc + sonuc2
son

ali        62.0
mehmet      NaN
osman     110.0
temel      44.0
dtype: float64

## Data Frame
* *Verilerin excel tablosu gibi gösterilmesi*

In [82]:
data=np.random.rand(4,3)
data

array([[0.58585585, 0.62295339, 0.35829008],
       [0.81618695, 0.02828285, 0.66488174],
       [0.02448653, 0.58335014, 0.81293704],
       [0.80713534, 0.79266865, 0.98756448]])

In [83]:
dataFrame = pd.DataFrame(data)
dataFrame

          0         1         2
0  0.585856  0.622953  0.358290
1  0.816187  0.028283  0.664882
2  0.024487  0.583350  0.812937
3  0.807135  0.792669  0.987564

In [84]:
newDataFrame = pd.DataFrame(data,index=["osman","ali","veli","mehmet"],columns=["maas","yas","saat"] )
newDataFrame

            maas       yas      saat
osman   0.585856  0.622953  0.358290
ali     0.816187  0.028283  0.664882
veli    0.024487  0.583350  0.812937
mehmet  0.807135  0.792669  0.987564

In [85]:
newDataFrame["yas"]
newDataFrame["yas"]["osman"]

0.6229533861438876

In [86]:
newDataFrame.loc["osman"]
newDataFrame.iloc[1]

maas    0.816187
yas     0.028283
saat    0.664882
Name: ali, dtype: float64

### Yeni Kolon Ekleme / Silme

In [87]:
newDataFrame["EMEKLİ YASİ"] = newDataFrame["yas"] + newDataFrame["yas"]
newDataFrame

            maas       yas      saat  EMEKLİ YASİ
osman   0.585856  0.622953  0.358290     1.245907
ali     0.816187  0.028283  0.664882     0.056566
veli    0.024487  0.583350  0.812937     1.166700
mehmet  0.807135  0.792669  0.987564     1.585337

In [88]:
newDataFrame.drop("EMEKLİ YASİ",axis=1,inplace=True)  ## Kolon

In [89]:
newDataFrame.drop("osman",axis=0) ## Satir

            maas       yas      saat
ali     0.816187  0.028283  0.664882
veli    0.024487  0.583350  0.812937
mehmet  0.807135  0.792669  0.987564

In [90]:
newDataFrame<0.4

         maas    yas   saat
osman   False  False   True
ali     False   True  False
veli     True  False  False
mehmet  False  False  False

### İndex Değiştirme

In [91]:
# newDataFrame.reset_index()

In [ ]:
yeniindex=["a","b","c","d"]
newDataFrame.set_index("yeniindex")

### Multi İndexler

In [96]:
ilkIndex = ["osman","osman","osman","temel","temel","temel"]
icIndex = ["ali","veli","mehmet","Ho","ho","ho"]
birlesmisIndex=list(zip(ilkIndex, icIndex))
birlesmisIndex

[('osman', 'ali'),
 ('osman', 'veli'),
 ('osman', 'mehmet'),
 ('temel', 'Ho'),
 ('temel', 'ho'),
 ('temel', 'ho')]

In [98]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmisIndex)
birlesmisIndex

MultiIndex([('osman',    'ali'),
            ('osman',   'veli'),
            ('osman', 'mehmet'),
            ('temel',     'Ho'),
            ('temel',     'ho'),
            ('temel',     'ho')],
           )

In [101]:
listem =[[10,"A"],[20,"B"],[30,"C"],[40,"D"],[50,"E"],[60,"F"]]
listem =np.array(listem)
cfdataFrame =pd.DataFrame(listem,index=birlesmisIndex,columns=["yas","Meslek"])
cfdataFrame

             yas Meslek
osman ali     10      A
      veli    20      B
      mehmet  30      C
temel Ho      40      D
      ho      50      E
      ho      60      F